ai/vision/texture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>texture</title>
<!-- 2019-08-22 Thu 11:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Hack Chyson" />
</head>
<body>
<div id="content">
<h1 class="title">texture</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. RTV</a>
<ul>
<li><a href="#sec-1-1">1.1. BACKGROUND</a></li>
<li><a href="#sec-1-2">1.2. RTV</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> RTV</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> BACKGROUND</h3>
<div class="outline-text-3" id="text-1-1">
<p>
basis:<br  />
</p>
\begin{equation}
\arg\min_S\sum_p\left\{\frac{1}{2\lambda}(S_p-I_p)^2+|(\nabla S)_p|\right\}
\end{equation}
<p>
where \(I\) is the input,<br  />
\(p\) indexes 2D pixels,<br  />
S is the resulting structure image.<br  />
</p>

<p>
The data term \((S_p-I_p)^2\) is to make the extracted strucutres similar the those in the input images.<br  />
\(\sum_p|(\nabla S)_p|\) is the TV(total variation) <b>regularizer</b>, written as<br  />
</p>

\begin{equation}
\sum_p|(\nabla S)_p| = \sum_p|(\partial_xS)_p|+|(\partial_yS)_p|
\end{equation}

<p>
The regularizer has limited ability to distinguish between strong structural edges and texuture.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> RTV</h3>
<div class="outline-text-3" id="text-1-2">
<p>
pixel-wise windowed total variation:<br  />
</p>
\begin{equation}
\mathscr{D}_x(p) = \sum_{q\in R(p)} g_{p,q} |(\partial_xS)_q|
\end{equation}

\begin{equation}
\mathscr{D}_y(p) = \sum_{q\in R(p)} g_{p,q} |(\partial_yS)_q|
\end{equation}

<p>
where \(R(p)\) is the rectangle region centered at pixel \(p\),<br  />
\(g_{p,q}\) is a weighting function defined according to spaitial affinity,<br  />
</p>
\begin{equation}
g_{p,q}\propto \exp\left(-\frac{(x_p-x_q)^2+(y_p-y_q)^2}{2\sigma^2}\right)
\end{equation}
<p>
where \(\sigma\) controls the spatial scale of the window.<br  />
</p>


<p>
To distinguish prominent structures from the texture elements,<br  />
a windowed inherent variation is defined:<br  />
</p>
\begin{equation}
\mathscr{L}_x(p) = |\sum_{q\in R(p)} g_{p,q} (\partial_xS)_q|
\end{equation}

\begin{equation}
\mathscr{L}_y(p) = |\sum_{q\in R(p)} g_{p,q} (\partial_yS)_q|
\end{equation}
<p>
\(\mathscr{L}\) captures the overall spatial variation.<br  />
</p>


<p>
The resulting \(\mathscr{L}\) in a window that only<br  />
contains texture is generally smaller than that in a window also<br  />
including structural edges. An intuitive explanation is that a major<br  />
edge in a local window contributes more similar-direction gradients<br  />
than textures with complex patterns.<br  />
</p>

<p>
RTV:<br  />
</p>
\begin{equation}
\arg\min_S\sum_p\left\{(S_p-I_p)^2+\lambda\left(\frac{\mathscr{D}_x(p)}{\mathscr{L}_x(p)+\epsilon}+\frac{\mathscr{D}_y(p)}{\mathscr{L}_y(p)+\epsilon}\right)\right\}
\end{equation}
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hack Chyson</p>
<p class="date">Created: 2019-08-22 Thu 11:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>